package org.example.fibonacci;

/**
 * Цей клас імплементує рекурсивний варіант алгоритму обчислення
 * числа Фібоначчі.
 * Оскільки кожен виклик метода calculate породжує два нові виклики, то
 * кількість викликів росте експоненційно. Тому часова складність буде
 * дорівнювати О(2^n)
 * Оскільки в тілі функції не відбувається операцій, пов'язаних з пам'яттю
 * То основні витрати у пам'яті - розмір стека рекурсивно вкликаних методів,
 * тому просторова складність О(n)
 */
public class RecursiveFibonacci {
    public int calculate(int n) {
        if (n <= 1) {
            return n;
        }

        return calculate(n - 1) + calculate(n - 2);
    }
}
